cat-harness/uml/overview/smart-base/smart-base-external-schemas.mmd
classDiagram
  direction TB
  namespace smart_base__smart_base_external_schemas {
    class smart_base_smart_base_external_schemas_folio_external_schema_v1_Term["Term"] {
      <<json: ExternalSchemaSchema>>
      term [1] string
      operative [1] string
    }
    class smart_base_smart_base_external_schemas_folio_external_schema_v1_folio_external_schema_v1["folio-external-schema/v1"] {
      <<json: ExternalSchemaSchema>>
      $schema [1] 'folio-external-schema/v1'
      id [1] string
      authority [1] enum(7)
      title [1] string
      version [1] string
      specUrl [1] string~uri~
      namespaces [0..*] string[]
      use [1] conforms | reads | cites
      terms [0..*] Term[]
      note [0..1] string
    }
    class smart_base_smart_base_external_schemas_folio_pinned_terminology_v1_Concept["Concept"] {
      <<json: PinnedTerminologySchema>>
      system [1] string
      code [1] string
      display [1] string
      deprecated [0..1] boolean
    }
    class smart_base_smart_base_external_schemas_folio_pinned_terminology_v1_folio_pinned_terminology_v1["folio-pinned-terminology/v1"] {
      <<json: PinnedTerminologySchema>>
      $schema [1] 'folio-pinned-terminology/v1'
      _comment [0..1] string
      pin [1] string
      version [1] string
      source [1] string
      concepts [0..*] Concept[]
    }
  }
  smart_base_smart_base_external_schemas_folio_external_schema_v1_folio_external_schema_v1 *-- "0..*" smart_base_smart_base_external_schemas_folio_external_schema_v1_Term : terms
  smart_base_smart_base_external_schemas_folio_pinned_terminology_v1_folio_pinned_terminology_v1 *-- "0..*" smart_base_smart_base_external_schemas_folio_pinned_terminology_v1_Concept : concepts
  cssClass "smart_base_smart_base_external_schemas_folio_external_schema_v1_Term" fa_uml_kind_external_schema
  cssClass "smart_base_smart_base_external_schemas_folio_external_schema_v1_folio_external_schema_v1" fa_uml_kind_external_schema
  cssClass "smart_base_smart_base_external_schemas_folio_pinned_terminology_v1_Concept" fa_uml_kind_external_schema
  cssClass "smart_base_smart_base_external_schemas_folio_pinned_terminology_v1_folio_pinned_terminology_v1" fa_uml_kind_external_schema
